## Load Dataset

In [73]:
import torch

In [76]:
# with open("instructions.txt", "r", encoding="utf-8") as f:
#     text = f.read()
import pandas as pd
train = pd.read_parquet('../../data/train/train-00000-of-00001.parquet',columns=['question','query'])

text = train.sample(frac=0.2).reset_index(drop=True)

# train_sample.drop('source', axis=1,inplace=True)

text

,question,query
0,Of all players with an overall rating greater ...,"SELECT preferred_foot , count(*) FROM Player_..."
1,Count the number of captains that have each rank.,"SELECT count(*) , rank FROM captain GROUP BY ..."
2,Show ids of students who don't play video game.,SELECT StuID FROM Student EXCEPT SELECT StuID ...
3,Which papers' first author is affiliated with ...,SELECT t3.title FROM authors AS t1 JOIN author...
4,"What are the first names, office locations, an...","SELECT T2.emp_fname , T4.prof_office , T3.cr..."
...,...,...
1395,What is the year and semester with the most co...,"SELECT semester , YEAR FROM SECTION GROUP BY ..."
1396,"What is the product, chromosome and porphyria ...","SELECT product , chromosome , porphyria FROM..."
1397,Find id of candidates whose assessment code is...,SELECT candidate_id FROM candidate_assessments...
1398,How many friends does Dan have?,SELECT count(T2.friend) FROM Person AS T1 JOIN...
1399,Show all the distinct buildings that have facu...,SELECT DISTINCT building FROM Faculty

In [77]:
type(text), text[:3], len(text)

(pandas.core.frame.DataFrame,
                                             question  \
 0  Of all players with an overall rating greater ...
 1  Count the number of captains that have each rank.
 2    Show ids of students who don't play video game.

                                                query
 0  SELECT preferred_foot ,  count(*) FROM Player_...
 1  SELECT count(*) ,  rank FROM captain GROUP BY ...
 2  SELECT StuID FROM Student EXCEPT SELECT StuID ...  ,
 1400)

In [78]:
# import random

# seed = 42

# random.seed(seed)
# random.shuffle(text)  # this could also be a parameter

In [79]:
train_dataset = text[:-100]
eval_dataset = text[-100:]

In [80]:
train_dataset, eval_dataset

(                                               question  \
 0     Of all players with an overall rating greater ...
 1     Count the number of captains that have each rank.
 2       Show ids of students who don't play video game.
 3     Which papers' first author is affiliated with ...
 4     What are the first names, office locations, an...
 ...                                                 ...
 1295  Give the names of people who did not participa...
 1296  List the hardware model name for the phones th...
 1297  Find the last name of the latest contact indiv...
 1298  Which student visited restaurant most often? L...
 1299                         How many events are there?

                                                   query
 0     SELECT preferred_foot ,  count(*) FROM Player_...
 1     SELECT count(*) ,  rank FROM captain GROUP BY ...
 2     SELECT StuID FROM Student EXCEPT SELECT StuID ...
 3     SELECT t3.title FROM authors AS t1 JOIN author...
 4     SELECT T2.emp_fname ,  T4.prof_office ,  T3.cr...
 ...                                                 ...
 1295  SELECT name FROM people WHERE people_id NOT IN...
 1296  SELECT DISTINCT T2.Hardware_Model_name FROM sc...
 1297  SELECT t3.individual_last_name FROM organizati...
 1298  SELECT Student.Fname , Student.Lname FROM Stud...
 1299                         SELECT count(*) FROM event

 [1300 rows x 2 columns],
                                                question  \
 1300  For each zip code, how many times has the maxi...
 1301                       How many premises are there?
 1302  What is the average fee for a CSU campus in th...
 1303  How many states have a college with more stude...
 1304  List all information about the assessment note...
 ...                                                 ...
 1395  What is the year and semester with the most co...
 1396  What is the product, chromosome and porphyria ...
 1397  Find id of candidates whose assessment code is...
 1398                    How many friends does Dan have?
 1399  Show all the distinct buildings that have facu...

                                                   query
 1300  SELECT zip_code , count(*) FROM weather WHERE ...
 1301                      SELECT count(*) FROM premises
 1302  SELECT avg(campusfee) FROM csu_fees WHERE YEAR...
 1303  SELECT count(DISTINCT state) FROM college WHER...
 1304  SELECT * FROM Assessment_Notes ORDER BY date_o...
 ...                                                 ...
 1395  SELECT semester ,  YEAR FROM SECTION GROUP BY ...
 1396  SELECT product ,  chromosome ,  porphyria FROM...
 1397  SELECT candidate_id FROM candidate_assessments...
 1398  SELECT count(T2.friend) FROM Person AS T1 JOIN...
 1399              SELECT DISTINCT building FROM Faculty

 [100 rows x 2 columns])

In [81]:
def prompt_no_input(row):
    return ("Below is an instruction that describes a task. "
            "Write a response that appropriately completes the request.\n\n"
            "### Instruction:\n{question}\n\n### Response:\n").format_map(row)

In [82]:
row = text.iloc[0,:]
print(prompt_no_input(row))

Below is an instruction that describes a task. Write a response that appropriately completes the request.

### Instruction:
Of all players with an overall rating greater than 80, how many are right-footed and left-footed?

### Response:

In [83]:
def prompt_input(row):
    return ("Below is an instruction that describes a task, paired with an input that provides further context. "
            "Write a response that appropriately completes the request.\n\n"
            "### Instruction:\n{question}\n\n### Input:\n{input}\n\n### Response:\n").format_map(row)

In [84]:
print(prompt_no_input(row))

Below is an instruction that describes a task. Write a response that appropriately completes the request.

### Instruction:
Of all players with an overall rating greater than 80, how many are right-footed and left-footed?

### Response:

In [85]:
def create_alpaca_prompt(row):
    return prompt_no_input(row) if row["input"] == "" else prompt_input(row)

In [86]:
[row for i, row in train_dataset.iterrows()]

[question    Of all players with an overall rating greater ...
 query       SELECT preferred_foot ,  count(*) FROM Player_...
 Name: 0, dtype: object,
 question    Count the number of captains that have each rank.
 query       SELECT count(*) ,  rank FROM captain GROUP BY ...
 Name: 1, dtype: object,
 question      Show ids of students who don't play video game.
 query       SELECT StuID FROM Student EXCEPT SELECT StuID ...
 Name: 2, dtype: object,
 question    Which papers' first author is affiliated with ...
 query       SELECT t3.title FROM authors AS t1 JOIN author...
 Name: 3, dtype: object,
 question    What are the first names, office locations, an...
 query       SELECT T2.emp_fname ,  T4.prof_office ,  T3.cr...
 Name: 4, dtype: object,
 question    Where is the club "Hopkins Student Enterprises...
 query       SELECT clublocation FROM club WHERE clubname  ...
 Name: 5, dtype: object,
 question    Show the nominees that have nominated musicals...
 query       SELECT Nominee FROM musical WHERE Award  =  "T...
 Name: 6, dtype: object,
 question    Which claim processing stage has the most clai...
 query       SELECT t2.claim_status_name FROM claims_proces...
 Name: 7, dtype: object,
 question    What are the categories of music festivals for...
 query       SELECT Category FROM music_festival GROUP BY C...
 Name: 8, dtype: object,
 question      Show ids, customer ids, names for all accounts.
 query       SELECT account_id ,  customer_id ,  account_na...
 Name: 9, dtype: object,
 question    List the name of all playlist.
 query          SELECT name FROM playlists;
 Name: 10, dtype: object,
 question    List the name of albums that are released by a...
 query       SELECT T2.title FROM artists AS T1 JOIN albums...
 Name: 11, dtype: object,
 question                How many lessons have been cancelled?
 query       SELECT count(*) FROM Lessons WHERE lesson_stat...
 Name: 12, dtype: object,
 question    What are the ids of documents with the type co...
 query       SELECT document_id FROM Documents WHERE docume...
 Name: 13, dtype: object,
 question    What is the location name of the document "Rob...
 query       SELECT T3.location_name FROM All_documents AS ...
 Name: 14, dtype: object,
 question    What are the ids, names and genders of the arc...
 query       SELECT T1.id ,  T1.name ,  T1.gender FROM arch...
 Name: 15, dtype: object,
 question    what are the details of the cmi masters that h...
 query       SELECT T1.cmi_details FROM Customer_Master_Ind...
 Name: 16, dtype: object,
 question    What is the average salary of employees who ha...
 query       SELECT department_id ,  AVG(salary) FROM emplo...
 Name: 17, dtype: object,
 question    What are the different ship flags, and how man...
 query         SELECT count(*) ,  flag FROM ship GROUP BY flag
 Name: 18, dtype: object,
 question    Give me the claim date, settlement date for al...
 query       SELECT Date_Claim_Made ,  Date_Claim_Settled F...
 Name: 19, dtype: object,
 question    List the name and phone number of all supplier...
 query       SELECT T1.supplier_name ,  T1.supplier_phone F...
 Name: 20, dtype: object,
 question    which country did participated in the most num...
 query       SELECT country FROM competition WHERE competit...
 Name: 21, dtype: object,
 question    What are the account details with the largest ...
 query       SELECT max(Account_details) FROM Accounts UNIO...
 Name: 22, dtype: object,
 question    List the age of all music artists.
 query                   SELECT Age FROM artist
 Name: 23, dtype: object,
 question    What are the different names of the colleges i...
 query        SELECT DISTINCT cName FROM tryout ORDER BY cName
 Name: 24, dtype: object,
 question    How many registed students do each course have...
 query       SELECT T3.course_name ,  count(*) FROM student...
 Name: 25, dtype: object,
 question    Show the name of drivers in descending order o...
 query               SELECT name FROM driver ORDER BY age DESC
 Name: 26, dtype: object,
 question    What is the id of the student who most recentl...
 query       SELECT student_id FROM student_course_attendan...
 Name: 27, dtype: object,
 question    What are the ids of the problems which are rep...
 query       SELECT problem_id FROM problems WHERE date_pro...
 Name: 28, dtype: object,
 question                    How many songs have a lead vocal?
 query       SELECT count(DISTINCT title) FROM vocals AS T1...
 Name: 29, dtype: object,
 question    What is the county that produces the most wine...
 query       SELECT T1.County FROM APPELLATIONS AS T1 JOIN ...
 Name: 30, dtype: object,
 question    How many professors are teaching class with co...
 query       SELECT count(DISTINCT PROF_NUM) FROM CLASS WHE...
 Name: 31, dtype: object,
 question      What is the name of tracks whose genre is Rock?
 query       SELECT T2.name FROM genres AS T1 JOIN tracks A...
 Name: 32, dtype: object,
 question    How many customers are there in the customer t...
 query       SELECT count(*) FROM customers GROUP BY custom...
 Name: 33, dtype: object,
 question    What are the names and trade names of the medi...
 query       SELECT name ,  trade_name FROM medicine WHERE ...
 Name: 34, dtype: object,
 question    What is the average, minimum, maximum, and tot...
 query       SELECT avg(transaction_amount) ,  min(transact...
 Name: 35, dtype: object,
 question    List the wheels and locations of the railways.
 query               SELECT Wheels ,  LOCATION FROM railway
 Name: 36, dtype: object,
 question               What is allergy type of a cat allergy?
 query       SELECT allergytype FROM Allergy_type WHERE all...
 Name: 37, dtype: object,
 question    Count the number of all the calendar items.
 query                 SELECT count(*) FROM Ref_calendar
 Name: 38, dtype: object,
 question    Find the type code of the most frequently used...
 query       SELECT policy_type_code FROM policies GROUP BY...
 Name: 39, dtype: object,
 question    Who has friends that are younger than the aver...
 query       SELECT DISTINCT T2.name FROM Person AS T1 JOIN...
 Name: 40, dtype: object,
 question    What are the different driver ids and national...
 query       SELECT DISTINCT T1.driverid ,  T1.nationality ...
 Name: 41, dtype: object,
 question                How many games has each stadium held?
 query       SELECT T1.id ,  count(*) FROM stadium AS T1 JO...
 Name: 42, dtype: object,
 question    Find the first and last name of the faculty wh...
 query       SELECT  T1.fname ,  T1.lname FROM Faculty AS T...
 Name: 43, dtype: object,
 question    Return the claim start date for the claims who...
 query       SELECT Date_Claim_Made FROM Claims WHERE Amoun...
 Name: 44, dtype: object,
 question    What is the "active to date" of the latest con...
 query       SELECT max(t2.active_to_date) FROM customers A...
 Name: 45, dtype: object,
 question    Show the ids of the employees who don't author...
 query       SELECT employee_id FROM Employees EXCEPT SELEC...
 Name: 46, dtype: object,
 question    What is average lesson price taught by staff w...
 query       SELECT avg(price) FROM Lessons AS T1 JOIN Staf...
 Name: 47, dtype: object,
 question    What are the different states that have studen...
 query       SELECT DISTINCT state FROM college AS T1 JOIN ...
 Name: 48, dtype: object,
 question    What categories have two or more corresponding...
 query       SELECT category FROM book_club WHERE YEAR  >  ...
 Name: 49, dtype: object,
 question    Count the total number of apartment bookings.
 query             SELECT count(*) FROM Apartment_Bookings
 Name: 50, dtype: object,
 question    Which buildings have more than one company off...
 query       SELECT T2.name FROM Office_locations AS T1 JOI...
 Name: 51, dtype: object,
 question    Show all origins and the number of flights fro...
 query       SELECT origin ,  count(*) FROM Flight GROUP BY...
 Name: 52, dtype: object,
 question    What is the velocity of the pilot named 'Thomp...
 query       SELECT avg(velocity) FROM flight WHERE pilot  ...
 Name: 53, dtype: object,
 question    Find the names of districts where have both ci...
 query       SELECT t3.District_name FROM store AS t1 JOIN ...
 Name: 54, dtype: object,
 question    display the department ID, full name (first an...
 query       SELECT first_name ,   last_name ,   salary ,  ...
 Name: 55, dtype: object,
 question    What are the names of products that are not 'w...
 query       SELECT t1.product_name FROM products AS t1 JOI...
 Name: 56, dtype: object,
 question    Show the names of artworks in ascending order ...
 query       SELECT T2.Name FROM nomination AS T1 JOIN artw...
 Name: 57, dtype: object,
 question    Show the name, street address, and number of f...
 query       SELECT name ,  street_address ,  floors FROM b...
 Name: 58, dtype: object,
 question    What are the last name and office of all histo...
 query       SELECT T1.emp_lname ,  T2.prof_office FROM emp...
 Name: 59, dtype: object,
 question    What is all the information of all the product...
 query       SELECT * FROM products WHERE price BETWEEN 60 ...
 Name: 60, dtype: object,
 question    What are the title and issues of the books?
 query                  SELECT Title ,  Issues FROM book
 Name: 61, dtype: object,
 question    What is the document type description for docu...
 query       SELECT document_type_description FROM Ref_docu...
 Name: 62, dtype: object,
 question    IN which year did city "Taizhou ( Zhejiang )" ...
 query       SELECT T2.year FROM city AS T1 JOIN hosting_ci...
 Name: 63, dtype: object,
 question    Show the maximum share count of transactions w...
 query       SELECT max(share_count) FROM TRANSACTIONS WHER...
 Name: 64, dtype: object,
 question    List in alphabetic order all different amenities.
 query       SELECT amenity_name FROM dorm_amenity ORDER BY...
 Name: 65, dtype: object,
 question    Show names for all aircraft with at least two ...
 query       SELECT T2.name FROM Flight AS T1 JOIN Aircraft...
 Name: 66, dtype: object,
 question       How many employees have a first name of Ludie?
 query       SELECT count(*) FROM Staff WHERE first_name = ...
 Name: 67, dtype: object,
 question    How many different source system code for the ...
 query       SELECT count(DISTINCT source_system_code) FROM...
 Name: 68, dtype: object,
 question    List all club names in descending alphabetical...
 query                SELECT name FROM club ORDER BY name DESC
 Name: 69, dtype: object,
 question    List the publisher of the publication with the...
 query       SELECT Publisher FROM publication ORDER BY Pri...
 Name: 70, dtype: object,
 question    Find the first and last name of the author(s) ...
 query       SELECT t1.fname ,  t1.lname FROM authors AS t1...
 Name: 71, dtype: object,
 question    Find the last names of students with major 50.
 query         SELECT LName FROM STUDENT WHERE Major  =  50
 Name: 72, dtype: object,
 question    What are the names of all female candidates in...
 query       SELECT t1.name FROM people AS t1 JOIN candidat...
 Name: 73, dtype: object,
 question    Show the status shared by cities with populati...
 query       SELECT Status FROM city WHERE Population  >  1...
 Name: 74, dtype: object,
 question    List the names of departments where some physi...
 query       SELECT DISTINCT T2.name FROM affiliated_with A...
 Name: 75, dtype: object,
 question    What are all the distinct details of the custo...
 query         SELECT DISTINCT customer_details FROM Customers
 Name: 76, dtype: object,
 question    Show the name of storms which don't have affec...
 query       SELECT name FROM storm WHERE storm_id NOT IN (...
 Name: 77, dtype: object,
 question    Return the apartment numbers of the apartments...
 query       SELECT apt_number FROM Apartments WHERE apt_ty...
 Name: 78, dtype: object,
 question    How many kids stay in the rooms reserved by RO...
 query       SELECT kids FROM Reservations WHERE FirstName ...
 Name: 79, dtype: object,
 question            How many movie directors are there?
 query       SELECT COUNT (DISTINCT director) FROM movie
 Name: 80, dtype: object,
 question    Show different parties of people along with th...
 query       SELECT Party ,  COUNT(*) FROM people GROUP BY ...
 Name: 81, dtype: object,
 question    For any rating where the name of reviewer is t...
 query       SELECT DISTINCT T3.name ,  T2.title ,  T1.star...
 Name: 82, dtype: object,
 question    Who has friends that are older than the averag...
 query       SELECT DISTINCT T2.name ,  T2.friend ,  T1.age...
 Name: 83, dtype: object,
 question    Show the dates of performances with attending ...
 query       SELECT T3.Date FROM member_attendance AS T1 JO...
 Name: 84, dtype: object,
 question    What is the id of the event with the most part...
 query       SELECT Event_ID FROM Participants_in_Events GR...
 Name: 85, dtype: object,
 question        Please show the most common publication date.
 query       SELECT Publication_Date FROM publication GROUP...
 Name: 86, dtype: object,
 question    List the description of the outcomes for all p...
 query       SELECT T1.outcome_description FROM Research_ou...
 Name: 87, dtype: object,
 question    List all the username and passwords of users w...
 query       SELECT user_name ,  password FROM users GROUP ...
 Name: 88, dtype: object,
 question    What are the maximum and minimum number of sil...
 query        SELECT max(Silver) ,  min(Silver) FROM club_rank
 Name: 89, dtype: object,
 question    What is the role name and role description for...
 query       SELECT T2.role_name ,  T2.role_description FRO...
 Name: 90, dtype: object,
 question    What are the different carriers for devices, l...
 query         SELECT Carrier FROM device ORDER BY Carrier ASC
 Name: 91, dtype: object,
 question    List the names of all routes in alphabetic order.
 query       SELECT route_name FROM Delivery_Routes ORDER B...
 Name: 92, dtype: object,
 question    Find the last name of the individuals that hav...
 query       SELECT DISTINCT t1.individual_last_name FROM i...
 Name: 93, dtype: object,
 question    What is all the information about the Marketin...
 query       SELECT * FROM  departments WHERE department_na...
 Name: 94, dtype: object,
 question    What is the average number of working horses o...
 query       SELECT avg(Working_Horses) FROM farm WHERE Tot...
 Name: 95, dtype: object,
 question    What are the names of stations that have latit...
 query             SELECT name FROM station WHERE lat  <  37.5
 Name: 96, dtype: object,
 question    What is the name of the customer who has the m...
 query       SELECT T1.customer_name FROM customers AS T1 J...
 Name: 97, dtype: object,
 question    What amenities does Smith Hall have in alphabe...
 query       SELECT T3.amenity_name FROM dorm AS T1 JOIN ha...
 Name: 98, dtype: object,
 question    Find the name of the user who gives the most r...
 query       SELECT T1.name FROM useracct AS T1 JOIN review...
 Name: 99, dtype: object,
 question    How many lesson does customer with first name ...
 query       SELECT count(*) FROM Lessons AS T1 JOIN Custom...
 Name: 100, dtype: object,
 question    How many proteins are associated with an insti...
 query       SELECT count(*) FROM institution AS T1 JOIN pr...
 Name: 101, dtype: object,
 question    What are the characters and duration of actors?
 query               SELECT Character ,  Duration FROM actor
 Name: 102, dtype: object,
 question    What are the names of colleges that have two o...
 query       SELECT College FROM match_season GROUP BY Coll...
 Name: 103, dtype: object,
 question    What are the names of all colleges with a larg...
 query       SELECT cName FROM college WHERE enr  >  (SELEC...
 Name: 104, dtype: object,
 question    What is the average total number of passengers...
 query       SELECT avg(T3.Total_Passengers) FROM aircraft ...
 Name: 105, dtype: object,
 question    What are the first names of student who only t...
 query       SELECT T1.stu_fname FROM student AS T1 JOIN en...
 Name: 106, dtype: object,
 question    What are the names of all instructors who advi...
 query       SELECT T2.name FROM advisor AS T1 JOIN instruc...
 Name: 107, dtype: object,
 question    Show names for all employees who have certific...
 query       SELECT T1.name FROM Employee AS T1 JOIN Certif...
 Name: 108, dtype: object,
 question    Which location has the most corresponding coun...
 query       SELECT LOCATION FROM county_public_safety GROU...
 Name: 109, dtype: object,
 question    What is the installation date for each ending ...
 query       SELECT T1.id ,  T2.installation_date FROM trip...
 Name: 110, dtype: object,
 question    Find the starting date and ending data in loca...
 query       SELECT T1.date_in_location_from ,  T1.date_in_...
 Name: 111, dtype: object,
 question    Find the first and last names of people who pa...
 query       SELECT T1.firstname ,  T1.lastname FROM Reserv...
 Name: 112, dtype: object,
 question    What are the heights of body builders with tot...
 query       SELECT T2.Height FROM body_builder AS T1 JOIN ...
 Name: 113, dtype: object,
 question    How many trips started from Mountain View city...
 query       SELECT count(*) FROM station AS T1 JOIN trip A...
 Name: 114, dtype: object,
 question    How many different locations does each school ...
 query       SELECT count(DISTINCT dept_address) ,  school_...
 Name: 115, dtype: object,
 question      How many courses that do not have prerequisite?
 query       SELECT count(*) FROM course WHERE course_id NO...
 Name: 116, dtype: object,
 question    What are the name, origin and owner of each pr...
 query             SELECT name ,  origin ,  OWNER FROM program
 Name: 117, dtype: object,
 question    What are the names of wines, sorted by price a...
 query           SELECT DISTINCT Name FROM WINE ORDER BY price
 Name: 118, dtype: object,
 question    What are the case burdens of counties, ordered...
 query       SELECT Case_burden FROM county_public_safety O...
 Name: 119, dtype: object,
 question    Tell me the the date when the first claim was ...
 query       SELECT Date_Claim_Made FROM Claims ORDER BY Da...
 Name: 120, dtype: object,
 question    What are the details of the student who regist...
 query       SELECT T1.student_details FROM students AS T1 ...
 Name: 121, dtype: object,
 question    What is the average access count of documents?
 query              SELECT avg(access_count) FROM documents
 Name: 122, dtype: object,
 question    What are the names of the states that have som...
 query       SELECT T1.state FROM college AS T1 JOIN tryout...
 Name: 123, dtype: object,
 question    Find the number of scientists involved for eac...
 query       SELECT count(*) ,  T1.name FROM projects AS T1...
 Name: 124, dtype: object,
 question          Show student ids who don't have any sports.
 query       SELECT StuID FROM Student EXCEPT SELECT StuID ...
 Name: 125, dtype: object,
 question    What are the employee ids for those who had tw...
 query       SELECT employee_id FROM job_history GROUP BY e...
 Name: 126, dtype: object,
 question    What is the name of department where has the s...
 query       SELECT T2.dept_name FROM professor AS T1 JOIN ...
 Name: 127, dtype: object,
 question    For each zip code, find the ids of all trips t...
 query       SELECT T1.id FROM trip AS T1 JOIN weather AS T...
 Name: 128, dtype: object,
 question    For each submission, show the author and their...
 query                SELECT Author ,  College FROM submission
 Name: 129, dtype: object,
 question       Show all date and share count of transactions.
 query       SELECT date_of_transaction ,  share_count FROM...
 Name: 130, dtype: object,
 question    What is the last name of the contact individua...
 query       SELECT t3.individual_last_name FROM organizati...
 Name: 131, dtype: object,

In [87]:
train_prompts = [prompt_no_input(row) for i, row in train_dataset.iterrows()]
eval_prompts = [prompt_no_input(row) for i, row in eval_dataset.iterrows()]

In [88]:
print(train_prompts[0])

Below is an instruction that describes a task. Write a response that appropriately completes the request.

### Instruction:
Of all players with an overall rating greater than 80, how many are right-footed and left-footed?

### Response:

In [89]:
def pad_eos(ds):
    EOS_TOKEN = "</s>"
    return [f"{row['query']}{EOS_TOKEN}" for _,row in ds.iterrows()]

In [90]:
train_outputs = pad_eos(train_dataset)
eval_outputs = pad_eos(eval_dataset)
train_outputs[0]

'SELECT preferred_foot ,  count(*) FROM Player_Attributes WHERE overall_rating  >  80 GROUP BY preferred_foot</s>'

In [91]:
train_dataset = [{"prompt":s, "output":t, "example": s + t} for s, t in zip(train_prompts, train_outputs)]
eval_dataset = [{"prompt":s, "output":t, "example": s + t} for s, t in zip(eval_prompts, eval_outputs)]

In [92]:
train_dataset[0]

{'prompt': 'Below is an instruction that describes a task. Write a response that appropriately completes the request.\n\n### Instruction:\nOf all players with an overall rating greater than 80, how many are right-footed and left-footed?\n\n### Response:\n',
 'output': 'SELECT preferred_foot ,  count(*) FROM Player_Attributes WHERE overall_rating  >  80 GROUP BY preferred_foot</s>',
 'example': 'Below is an instruction that describes a task. Write a response that appropriately completes the request.\n\n### Instruction:\nOf all players with an overall rating greater than 80, how many are right-footed and left-footed?\n\n### Response:\nSELECT preferred_foot ,  count(*) FROM Player_Attributes WHERE overall_rating  >  80 GROUP BY preferred_foot</s>'}

In [100]:
import tiktoken
tokenizer = tiktoken.get_encoding('gpt2')

In [101]:
tokenizer.encode("experiments are going strong!")

[23100, 6800, 389, 1016, 1913, 0]

TypeError: encode() got an unexpected keyword argument 'padding'

In [102]:
# max_sequence_len = 1024

# def pack(dataset, max_seq_len=max_sequence_len):
#     tkds_ids = tokenizer([s["example"] for s in dataset])["input_ids"]
    
#     all_token_ids = []
#     for tokenized_input in tkds_ids:
#         all_token_ids.extend(tokenized_input)# + [tokenizer.eos_token_id])
    
#     print(f"Total number of tokens: {len(all_token_ids)}")
#     packed_ds = []
#     for i in range(0, len(all_token_ids), max_seq_len+1):
#         input_ids = all_token_ids[i : i + max_seq_len+1]
#         if len(input_ids) == (max_seq_len+1):
#             packed_ds.append({"input_ids": input_ids[:-1], "labels": input_ids[1:]})  # this shift is not needed if using the model.loss
#     return packed_ds

In [110]:
from torch.utils.data import DataLoader
from transformers import default_data_collator

torch.manual_seed(123)
batch_size = 16  # I have an A100 GPU with 40GB of RAM ðŸ˜Ž

train_dataloader = DataLoader(
    train_dataset,
    batch_size=batch_size,
    collate_fn=default_data_collator, # we don't need any special collator ðŸ˜Ž
)

eval_dataloader = DataLoader(
    eval_dataset,
    batch_size=batch_size,
    collate_fn=default_data_collator,
    shuffle=False,
)

/Users/jagpreetsingh/ML_Projects/text-sql/.venv/lib/python3.9/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [111]:
b = next(iter(train_dataloader))
b

{}

In [114]:
from types import SimpleNamespace

gradient_accumulation_steps = 2

config = SimpleNamespace(
    model_id='my_model.pt',
    dataset_name="alpaca-gpt4",
    precision="bf16",  # faster and better than fp16, requires new GPUs
    n_freeze=24,  # How many layers we don't train, LLama 7B has 32.
    lr=2e-4,
    n_eval_samples=10, # How many samples to generate on validation
    max_seq_len=max_sequence_len, # Lenght of the sequences to pack
    epochs=3,  # we do 3 pasess over the dataset.
    gradient_accumulation_steps=gradient_accumulation_steps,  # evey how many iterations we update the gradients, simulates larger batch sizes
    batch_size=batch_size,  # what my GPU can handle, depends on how many layers are we training  
    log_model=False,  # upload the model to W&B?
    gradient_checkpointing = True,  # saves even more memory
    freeze_embed = True,  # why train this? let's keep them frozen â„ï¸
    seed=seed,
)

config.total_train_steps = config.epochs * len(train_dataloader) // config.gradient_accumulation_steps

{}